import { Col, Row } from "antd";
import styles from "./about.module.scss";

const AboutComponent: React.FC = () => {
  return (
    <div>
      <Row gutter={16} className={styles["container"]}>
        <Col className={styles["info-container"]} xs={24} lg={12}>
          <p className={styles["info-container--text"]}>
            Затишний будиночок у самому серці соснового лісу розташований у
            місті Полтава для повноцінного відпочинку на природі.. Тут панує
            тиша, свіже повітря та затишок — усе, що потрібно для повного
            перезавантаження. На території: зелений доглянутий газон, купіль під
            відкритим небом, мангал для вечірніх посиденьок і атмосфера
            справжнього відпочинку. Це ідеальне місце для тих, хто мріє втекти
            від міського шуму й зануритися в природу, не жертвуючи комфортом.
          </p>
        </Col>
        <Col className={styles["info-container"]} xs={24} lg={12}>
          <p className={styles["info-container--text"]}>
            Затишний будиночок у самому серці соснового лісу розташований у
            місті Полтава для повноцінного відпочинку на природі.. Тут панує
            тиша, свіже повітря та затишок — усе, що потрібно для повного
            перезавантаження. На території: зелений доглянутий газон, купіль під
            відкритим небом, мангал для вечірніх посиденьок і атмосфера
            справжнього відпочинку. Це ідеальне місце для тих, хто мріє втекти
            від міського шуму й зануритися в природу, не жертвуючи комфортом.
          </p>
        </Col>
      </Row>
    </div>
  );
};

export default AboutComponent;
